In [6]:
import pandas as pd

# Left DataFrame: Employee Info
df1 = pd.DataFrame({
    'employee_id': [1, 2, 3, 4],
    'name': ['Alice', 'Bob', 'Charlie', 'David']
})

# Right DataFrame: Salary Info
df2 = pd.DataFrame({
    'employee_id': [2, 3, 4, 5],
    'salary': [50000, 60000, 70000, 80000]
})

In [7]:
print(df1)
print(df2)

   employee_id     name
0            1    Alice
1            2      Bob
2            3  Charlie
3            4    David
   employee_id  salary
0            2   50000
1            3   60000
2            4   70000
3            5   80000

In [10]:
pd.merge(df1, df2, on='employee_id', how='inner')

   employee_id     name  salary
0            2      Bob   50000
1            3  Charlie   60000
2            4    David   70000

In [ ]:
pd.merge(df1, df2, on='employee_id', how='left')  # Left join

   employee_id     name   salary
0            1    Alice      NaN
1            2      Bob  50000.0
2            3  Charlie  60000.0
3            4    David  70000.0

In [12]:
pd.merge(df1, df2, on='employee_id', how='right')

   employee_id     name  salary
0            2      Bob   50000
1            3  Charlie   60000
2            4    David   70000
3            5      NaN   80000

In [13]:
pd.merge(df1, df2, on='employee_id', how='outer')  # Full outer join

   employee_id     name   salary
0            1    Alice      NaN
1            2      Bob  50000.0
2            3  Charlie  60000.0
3            4    David  70000.0
4            5      NaN  80000.0